Autodesk.Revit.DB.Transform2D.TransformUVDomainIfPossible(Autodesk.Revit.DB.BoundingBoxUV)
Transforms an envelope (Autodesk.Revit.DB.BoundingBoxUV) for one surface to an envelope for a coincident but differently parameterized surface.
Remarks:
This method succeeds in the case when the uv-parameter transform between the surfaces
has a simple form, that commonly occurs for analytic surfaces,
such that the image of the input envelope under the transform
is itself a rectangular region aligned with the UV coordinate axes.
uvDomain:
The original surface envelope.
Returns:
If successful a new Autodesk.Revit.DB.BoundingBoxUV transformed surface envelope, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
uvDomain is not set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV)
Applies the transformation to the vector and returns the result.
Remarks:
Transformation of a vector is not affected by the translational part of the transformation.
vector:
The vector to transform.
Returns:
The transformed vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.OfPoint(Autodesk.Revit.DB.UV)
Applies the transformation to the point and returns the result.
Remarks:
Transformation of a point is affected by the translational part of the transformation.
point:
The point to transform.
Returns:
The transformed point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.Multiply(Autodesk.Revit.DB.Transform2D)
Multiplies this transformation by the specified transformation and returns the result.
Remarks:
The combined transformation has the same effect as applying the right transformation first, and this transformation, second.
So, denoting this transform by T1 and the right transform by T2, (T1(T2(p)) = (T1 * T2) (p).
Returns:
The transformation equal to the composition of the two transformations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.Assign(Autodesk.Revit.DB.Transform2D)
Assigns values from the input transformation to this transformation.
from:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.AlmostEqual(Autodesk.Revit.DB.Transform2D)
Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09).
Remarks:
The tolerance is applied memberwise for comparison.
right:
The transformation to compare with this transformation.
Returns:
True if the two transformations are equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.BasisV
The image of (0, 1) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.BasisU
The image of (1, 0) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.Origin
The image of (0, 0) under Autodesk.Revit.DB.Transform2D.OfPoint(Autodesk.Revit.DB.UV).
This defines the translational part of the transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.#ctor(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV)
Constructs the transformation by specifying the vectors and the origin.
uVec:
The image of (1, 0) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
vVec:
The image of (0, 1) under Autodesk.Revit.DB.Transform2D.OfVector(Autodesk.Revit.DB.UV).
origin:
The image of (0, 0) under Autodesk.Revit.DB.Transform2D.OfPoint(Autodesk.Revit.DB.UV).
This defines the translational part of the transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Transform2D.#ctor(Autodesk.Revit.DB.Transform2D)
The copy constructor.
other:
The transformation to use as input.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021